{"by": "danialasif", "descendants": 13, "id": 45116859, "kids": [45118866, 45118099, 45117145, 45117220, 45117413, 45117585], "score": 25, "text": "Hi HN, I’m Danial, co-founder and CTO of Risely AI (<a href=\"https:&#x2F;&#x2F;risely.ai\">https:&#x2F;&#x2F;risely.ai</a>). We&#x27;re building AI agents that automate operational workflows inside universities. Here’s a demo: <a href=\"https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;d7a14400434144c490249d665a0d0499?sid=8d36736e-6c87-43d3-992d-203c6edb0cf9\" rel=\"nofollow\">https:&#x2F;&#x2F;www.loom.com&#x2F;share&#x2F;d7a14400434144c490249d665a0d0499?...</a>.<p>Higher ed is full of inefficiencies. Every department runs on outdated systems that don’t talk to each other. Today, advising staff are looking up enrollment data in PeopleSoft or Ellucian, checking grades and assignments in Canvas, and trying to track engagement in a CRM, if they even have one. Often, it’s just spreadsheets and email. One advisor told us they were losing 8+ hours&#x2F;week just trying to answer: “Which students are struggling?”. During that lag, students slip through the cracks, and every lost student costs a school tuition.<p>I’ve spent the last decade building large-scale systems, but about a year ago, I left my job to build something personal. My time at UC Berkeley reinforced what my parents taught me when we immigrated to the U.S. - that education is the most powerful tool for upward mobility. But nearly 40% of students never graduate. Many of these students are capable and just need support, but the systems meant to support them are overwhelmed and broken.<p>So we built Risely. Our first agent focuses on academic advising and retention. It connects to a school’s systems, unifies the data, flags at-risk students, drafts outreach, and answers natural-language questions about caseloads and course progress. It gives staff leverage and time back, while helping more students stay on track.<p>The harder part is everything under the hood:\n- Connecting to archaic SIS, LMS, and CRM systems with inconsistent APIs and data models\n- Normalizing messy institutional data into something agents can reason over \n- Handling real policy constraints around FERPA, isolating tenant data, and meeting strict security and privacy standards for student PII \n- Designing agent workflows that are traceable, reviewable, and safe to run in production \n- Building infrastructure that can adapt to different institutional rules, processes, and edge cases.<p>We started with advising because retention ties directly to both revenue and student success. But the same foundation applies to registrar, admissions, financial aid, research administration, and other critical functions. As more agents come online, they can begin to coordinate with each other and hopefully improve the entire operations of a college or university.<p>If you’ve built systems that had to reconcile messy data, inconsistent workflows, or policy constraints using LLMs, we’d love to hear how you approached it.<p>We’d love to hear your thoughts about the above, and anything in this space!", "time": 1756912895, "title": "Launch HN: Risely (YC S25) – AI Agents for Universities", "type": "story"}