{"by": "nickpapciak", "descendants": 15, "id": 45104974, "kids": [45107840, 45105695, 45107538, 45105529, 45106934, 45106309, 45105608], "score": 25, "text": "Hey HN! We’re Abhi, Venkat, Tom, and Nick and we are building Datafruit (<a href=\"https:&#x2F;&#x2F;datafruit.dev&#x2F;\">https:&#x2F;&#x2F;datafruit.dev&#x2F;</a>), an AI DevOps agent. We’re like Devin for DevOps. You can ask Datafruit to check your cloud spend, look for loose security policies, make changes to your IaC, and it can reason across your deployment standards, design docs, and DevOps practices.<p>Demo video: <a href=\"https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FitSggI7tg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=2FitSggI7tg</a>.<p>Right now, we have two main methods to interact with Datafruit:<p>(1) automated infrastructure audits— agents periodically scan your environment to find cost optimization opportunities, detect infrastructure drift, and validate your infra against compliance requirements.<p>(2) chat interface (available as a web UI and through slack) — ask the agent questions for real-time insights, or assign tasks directly, such as investigating spend anomalies, reviewing security posture, or applying changes to IaC resources.<p>Working at FAANG and various high-growth startups, we realized that infra work requires an enormous amount of context, often more than traditional software engineering. The business decisions, codebase, and cloud itself are all extremely important in any task that has been assigned. To maximize the success of the agents, we do a fair amount of context engineering. Not hallucinating is super important!<p>One thing which has worked incredibly well for us is a multi-agent system where we have specialized sub-agents with access to specific tool calls and documentation for their specialty. Agents choose to “handoff” to each other when they feel like another agent would be more specialized for the task. However, all agents share the same context (<a href=\"https:&#x2F;&#x2F;cognition.ai&#x2F;blog&#x2F;dont-build-multi-agents\" rel=\"nofollow\">https:&#x2F;&#x2F;cognition.ai&#x2F;blog&#x2F;dont-build-multi-agents</a>). We’re pretty happy with this approach, and believe it could work in other disciplines which require high amounts of specialized expertise.<p>Infrastructure is probably the most mission-critical part of any software organization, and needs extremely heavy guardrails to keep it safe. Language models are not yet at the point where they can be trusted to make changes (we’ve talked to a couple of startups where the Claude Code + AWS CLI combo has taken their infra down). Right now, Datafruit receives read-only access to your infrastructure and can only make changes through pull requests to your IaC repositories. The agent also operates in a sandboxed virtual environment so that it could not write cloud CLI commands if it wanted to!<p>Where LLMs <i>can</i> add significant value is in reducing the constant operational inefficiencies that eat up cloud spend and delay deadlines—the small-but-urgent ops work. Once Datafruit indexes your environment, you can ask it to do things like:<p><pre><code>  &quot;Grant @User write access to analytics S3 bucket for 24 hours&quot;\n    -&gt; Creates temporary IAM role, sends least-privilege credentials, auto-revokes tomorrow\n\n  &quot;Find where this secret is used so I can rotate it without downtime&quot;\n    -&gt; Discovers all instances of your secret, including old cron-jobs you might not know about, so you can safely rotate your keys\n\n\n  &quot;Why did database costs spike yesterday?&quot;\n    -&gt; Identifies expensive queries, shows optimization options, implements fixes\n\n</code></pre>\nWe charge a straightforward subscription model for a managed version, but we also offer a bring-your-own-cloud model. All of Datafruit can be deployed on Kubernetes using Helm charts for enterprise customers where data can’t leave your VPC.\nFor the time being, we’re installing the product ourselves on customers&#x27; clouds. It doesn’t exist in a self-serve form yet. We’ll get there eventually, but in the meantime if you’re interested we’d love for you guys to email us at founders@datafruit.dev.<p>We would love to hear your thoughts! If you work with cloud infra, we are especially interested in learning about what kinds of work you do which you wish could be offloaded onto an agent.", "time": 1756829311, "title": "Launch HN: Datafruit (YC S25) – AI for DevOps", "type": "story"}