{"by": "antonybrahin", "descendants": 1, "id": 45103205, "kids": [45118996, 45119019], "score": 16, "text": "Hey HN,<p>In software development, the process of turning a user story into detailed documentation and actionable tasks is critical. However, this manual process can often be a source of inconsistency and a significant time investment. I was driven to see if I could streamline and elevate it.<p>I know this is a hot space, with big players like GitHub and Atlassian building integrated AI, and startups offering specialized platforms. My goal wasn&#x27;t to compete with them, but to see what was possible by building a custom, &quot;glass box&quot; solution using the best tools for each part of the job, without being locked into a single ecosystem.<p>What makes this approach different is the flexibility and full control. Instead of a pre-packaged product, this is a resilient workflow built on Power Automate, which acts as the orchestrator for a sequence of API calls:<p>Five calls to the Gemini API for the core generation steps (requirements, tech spec, test strategy, etc.).<p>One call to an Azure OpenAI model to create vector embeddings of our codebase.<p>One call to Azure AI Search to perform the Retrieval-Augmented Generation (RAG). This was the key to getting context-aware, non-generic outputs. It reads our actual code to inform the technical spec and tasks.<p>A bunch of direct calls to the Azure DevOps REST API (using a PAT) to create the wiki pages and work items, since the standard connectors were a bit limited.<p>The biggest challenge was moving beyond simple prompts and engineering a resilient system. Forcing the final output into a rigid JSON schema instead of parsing text was a game-changer for reliability.<p>The result is a system that saves us hours on every story and produces remarkably consistent, high-quality documentation and tasks.<p>The full write-up with all the challenges, final prompts, and screenshots is in the linked blog post.<p>I’m here to answer any questions. Would love to hear your feedback and ideas!", "time": 1756821507, "title": "Vector search on our codebase transformed our SDLC automation", "type": "story", "url": "https://medium.com/@antonybrahin/grounding-ai-in-reality-how-vector-search-on-our-codebase-transformed-our-sdlc-automation-7d068b1244a8"}